#+TITLE: Python 115 Class Notes
#+AUTHOR: Matthew Yackiel
#+PROPERTY: header-args :cache yes :mkdirp yes :results replace :exports both 

* Hello World!
:PROPERTIES:
:header-args: :results output :tangle ./Projects/Module_1/Lectures.py
:END:
The following code blocks illustrate the evolution of test.py from class.

The typical hello world program written in python.  The print function will output to the standard output i.e. the terminal output

#+begin_src python :results output
  print("Hello Python Programmers")
#+end_src

#+RESULTS:
: Hello Python Programmers

** Some exercises with Pycharm
#+begin_src python :results output :tangle ./Projects/Module_1/Lectures.py
  print("-----------------------------------")
  print(" this is a python programming class")
  print("-----------------------------------")
#+end_src

#+RESULTS:
:  this is a python programming class

** Integer Values

#+begin_src python 
x = 100 # numeric value
# display the variable
print(x)
#+end_src

#+RESULTS[a774b545e2068a57e00a45b73b03cb75e0fb83c2]:
: 100

** Integer operators

#+begin_src python
  # + operator is used with numbers to perform summation
  print(195 + 61)
#+end_src

#+RESULTS:
: 256

** String Values

Text is enclosed in a pair of single OR double quotes.  This seperates String Values from code structures.

#+begin_src python 
# Example in double quotes 
y = "Hello"
print(y)
# Example in single quotes
z = "Mahmoud"
print(z)
#+end_src

#+RESULTS:
: Hello
: Mahmoud

** Assigning Multiple Variables in one statement

#+begin_src python
  # Assigning multiple values to variables in one statement
  Fruit1 = Fruit2 = Fruit3 = "Apple", "Orange", "Banana"
  print(Fruit1)
  print(Fruit2)
  print(Fruit3)
#+end_src

#+RESULTS:
: ('Apple', 'Orange', 'Banana')
: ('Apple', 'Orange', 'Banana')
: ('Apple', 'Orange', 'Banana')

** Logical Errors
This is the most difficult to find.  Pycharm cannot help you with this (OUTSIDE OF THE DEBUGGER WHICH IS TOO ADNAVCED FOR THIS COURSE).  This is found when you get results from your program that are valid, however they are unexpected/incorrect results.

#+begin_src python 
  # add 45 + 5 and then divide by 5.
  print(45+5/ 10)
  # python takes order of operations very literally.  follow PEMDAS
  print((45+5)/10)
#+end_src

#+RESULTS[160206fcf99dbc80921f9ed1ba87278f2bd46f68]:
: 45.5
: 5.0


